test-repo/macros/Helpers/RealizarRequestCashOut.yaml

description: Preparar y realizar request cashOut
actions:
  - script: |
      var lineaAgente = "0" + $macroArgs.lineaAgente;
      $localData.lineaAgente = lineaAgente
      var lineaSuscriptor = "0" + $macroArgs.lineaSuscriptor;
      $localData.lineaSuscriptor = lineaSuscriptor

  - description: Construir el request
    action: org.getopentest.actions.Format
    args:
      template: |
        <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sch="http://xmlns.tigo.com/MFS/MFSServiceRequest/V2/schema" xmlns:v3="http://xmlns.tigo.com/RequestHeader/V3" xmlns:v2="http://xmlns.tigo.com/ParameterType/V2">
          <soapenv:Header/>
          <soapenv:Body>
              <sch:mfsCashOutRequest>
                <v3:RequestHeader>
                    <v3:GeneralConsumerInformation>
                      <!--Optional:-->
                      <v3:consumerID>AZKS</v3:consumerID>
                      <!--Optional:-->
                      <v3:transactionID>1</v3:transactionID>
                      <!--Optional:-->
                      <v3:country>PRY</v3:country>
                      <v3:correlationID>${$macroArgs.correlationid}</v3:correlationID>
                    </v3:GeneralConsumerInformation>
                </v3:RequestHeader>
                <sch:requestBody>
                    <sch:agentId>${$localData.lineaAgente}</sch:agentId>
                    <sch:agentPin>${$macroArgs.pinAgente}</sch:agentPin>
                    <sch:msisdn>${$localData.lineaSuscriptor}</sch:msisdn>
                    <sch:documentNumber>${$macroArgs.ciSuscriptor}</sch:documentNumber>
                    <sch:amount>${$macroArgs.monto}</sch:amount>
                    <sch:birthDate>${$macroArgs.fechaNac}</sch:birthDate>
                    <sch:additionalParameters>
                      <!--Zero or more repetitions:-->
                      <v2:ParameterType>
                          <v2:parameterName>PIN_BEHAVIOUR</v2:parameterName>
                          <v2:parameterValue>CMT</v2:parameterValue>
                      </v2:ParameterType>
                      <v2:ParameterType>
                          <v2:parameterName>CODIGO_SUCURSAL</v2:parameterName>
                          <v2:parameterValue>120</v2:parameterValue>
                      </v2:ParameterType>
                      <v2:ParameterType>
                          <v2:parameterName>SUCURSAL</v2:parameterName>
                          <v2:parameterValue>4M</v2:parameterValue>
                      </v2:ParameterType>
                      <v2:ParameterType>
                          <v2:parameterName>CODIGO_COMERCIO</v2:parameterName>
                          <v2:parameterValue>547812</v2:parameterValue>
                      </v2:ParameterType>
                      <v2:ParameterType>
                          <v2:parameterName>COMERCIO</v2:parameterName>
                          <v2:parameterValue>Los Hermanos</v2:parameterValue>
                      </v2:ParameterType>
                    </sch:additionalParameters>
                </sch:requestBody>
              </sch:mfsCashOutRequest>
          </soapenv:Body>
        </soapenv:Envelope>

  - script: |
      var response = $output.text

  - script: |
      var horaInicio = new Date();
      $log.error("HORA DE INICIO DE LANAZAMIENTO DE REQUEST CASH OUT: "+ horaInicio.toTimeString())

  - description: Realizar el SOAP Request
    action: org.getopentest.actions.HttpRequest
    args:
      url: https://pubapi-qa.telecel.net.py/osb/Platforms/MFS/CashOut/V2
      verb: POST
      headers:
        Content-Type: application/soap+xml; charset=utf-8
      body: $script response


  - description: Verificar el caso de prueba
    script: |
      var responseBody = $json($output.body);
      if(responseBody.indexOf("Ejecucion exitosa") > -1){
        $log.error("LA PRUEBA FUE EXITOSA");
      }else{
        $fail("LA PRUEBA NO FUE EXITOSA (VERIFICAR LOG MAS ARRIBA)");
      }